const ReviewSection = () => {
  return (
    <div className="detailsBox bg-white rounded-2xl p-6 shadow-sm border border-gray-100">
      <h3 className="dt_title text-xl font-bold text-gray-900 mb-4">
        <strong className="text-red-600">نقد </strong>
        کارشناسی ماشین شاهین اتوماتیک
      </h3>
      
      <div className="text_area text-gray-700 leading-8 text-justify space-y-4">
        <p>
          شاهین سدان کلاس C گروه خودروسازی سایپا بوده و از پلتفرم SP100 در آن 
          استفاده شده است. شاهین در ابتدا با نسخه های دنده ای تیپ G و اتوماتیک 
          CVT در خط تولید سایپا تولید و مونتاژ شد اما بعد ها شرکت سایپا تصمیم 
          گرفت که نسخه ارتقا یافته این خودرو را با نام شاهین پلاس به سبد محصولات 
          خود اضافه کند. با توجه به سیاست گذاری های سایپا، شاهین پلاس به لحاظ 
          فنی در دو نسخه در بازار ایران عرضه می شود که شامل تیپ اتومات و دنده 
          دستی است که جعبه دنده نسخه دنده دستی آن از نوع ۵ سرعته دستی و جعبه 
          دنده نسخه اتومات شاهین پلاس از نوع شش سرعته اتوماتیک AT است.
        </p>
        
        <p>
          طراحی بدنه شاهین پلاس بدنه شاهین پلاس تفاوت خاصی با نسخه های قبلی 
          ندارد و در بحث اِلِمان های ظاهری با شاهین اتوماتیک CVT برابر است. 
          در جلو پنجره این خودرو از قاب کرومی استفاده شده و دستگیره های کرومی 
          هم بر روی این سدان ایرانی نصب شده است. همچنین بالای قاب پلاک عقب 
          شاهین+، نوار کرومی رنگی دیده می شود که در شاهین اتوماتیک CVT هم وجود 
          دارد. از سوی دیگر نشان روی در صندوق عقب این خودرو با علامت + همراه 
          شده است.در سایر بخش های بیرونی شاهین پلاس تفاوتی را با نسخه های 
          قبلی نمی بینیم. رینگ های آلومینیومی این خودرو همچنان از نوع ۱۵ اینچی 
          است. پیش از این احتمال داده می شد که شاهین+ با رینگ آلومینیومی ۱۶ 
          اینچی به بازار بیاید.
        </p>
      </div>
    </div>
  );
};

export default ReviewSection;